tutorials/tutorials.DTLreactingFoam/counterFlowFlame2D/constant/thermo.FTM
species         5 ( CH4 H2O O2 CO2 N2 );

N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.0014879768 -5.68476e-07 1.0097038e-10 -6.753351e-15 -922.7977 5.980528 );
        lowCpCoeffs     ( 3.298677 0.0014082404 -3.963222e-06 5.641515e-09 -2.444854e-12 -1020.8999 3.950372 );
    }
    elements
    {
        N               2;
    }
    transport
    {
        muCoeffs        (-18.7928 2.3564 -0.229683 0.0102714);
        kappaCoeffs     (1.73563 -3.66431 0.664846 -0.0328505);
        DijCoeffs       (
                            (-25.0853 3.63653 -0.260141 0.0113939)
                            (-30.2612 5.5433 -0.487098 0.020417)
                            (-24.3747 3.3315 -0.221273 0.00973849)
                            (-27.3144 4.3644 -0.352369 0.0153064)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
        );
    }
}

CO2
{
    specie
    {
        molWeight       44.00995;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.85746029 0.00441437026 -2.21481404e-06 5.23490188e-10 -4.72084164e-14 -48759.166 2.27163806 );
        lowCpCoeffs     ( 2.35677352 0.00898459677 -7.12356269e-06 2.45919022e-09 -1.43699548e-13 -48371.9697 9.90105222 );
    }
    elements
    {
        C               1;
        O               2;
    }
    transport
    {
        muCoeffs        (-26.3191 5.15021 -0.575259 0.0245432);
        kappaCoeffs     (-23.1246 5.98573 -0.583197 0.0210317);
        DijCoeffs       (
                            (-28.4471 4.81747 -0.406845 0.0174929)
                            (-30.1572 5.09926 -0.39041 0.0146768)
                            (-27.6164 4.47195 -0.36524 0.0158195)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-27.3144 4.3644 -0.352369 0.0153064)
        );
    }
}

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.28253784 0.00148308754 -7.57966669e-07 2.09470555e-10 -2.16717794e-14 -1088.45772 5.45323129 );
        lowCpCoeffs     ( 3.78245636 -0.00299673416 9.84730201e-06 -9.68129509e-09 3.24372837e-12 -1063.94356 3.65767573 );
    }
    elements
    {
        O               2;
    }
    transport
    {
        muCoeffs        (-19.3405 2.62765 -0.265133 0.0118167);
        kappaCoeffs     (-13.8944 3.07851 -0.297333 0.0127535);
        DijCoeffs       (
                            (-25.3927 3.75885 -0.275697 0.0120551)
                            (-30.453 5.60295 -0.492151 0.0205307)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-27.6164 4.47195 -0.36524 0.0158195)
                            (-24.3747 3.3315 -0.221273 0.00973849)
        );
    }
}

CH4
{
    specie
    {
        molWeight       16.04303;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 0.074851495 0.0133909467 -5.73285809e-06 1.22292535e-09 -1.0181523e-13 -9468.34459 18.437318 );
        lowCpCoeffs     ( 5.14987613 -0.0136709788 4.91800599e-05 -4.84743026e-08 1.66693956e-11 -10246.6476 -4.64130376 );
    }
    elements
    {
        C               1;
        H               4;
    }
    transport
    {
        muCoeffs        (-22.2457 3.54364 -0.383872 0.0169568);
        kappaCoeffs     (0.812318 -4.54742 0.975145 -0.0536628);
        DijCoeffs       (
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-30.6998 5.62052 -0.483426 0.0197159)
                            (-25.3927 3.75885 -0.275697 0.0120551)
                            (-28.4471 4.81747 -0.406845 0.0174929)
                            (-25.0853 3.63653 -0.260141 0.0113939)
        );
    }
}

H2O
{
    specie
    {
        molWeight       18.01534;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.03399249 0.00217691804 -1.64072518e-07 -9.7041987e-11 1.68200992e-14 -30004.2971 4.9667701 );
        lowCpCoeffs     ( 4.19864056 -0.0020364341 6.52040211e-06 -5.48797062e-09 1.77197817e-12 -30293.7267 -0.849032208 );
    }
    elements
    {
        H               2;
        O               1;
    }
    transport
    {
        muCoeffs        (-12.9653 -1.33484 0.41556 -0.0238812);
        kappaCoeffs     (12.2672 -9.14258 1.55383 -0.077075);
        DijCoeffs       (
                            (-30.6998 5.62052 -0.483426 0.0197159)
                            (-9.21034 -6.44736e-26 9.25847e-27 -4.40439e-28)
                            (-30.453 5.60295 -0.492151 0.0205307)
                            (-30.1572 5.09926 -0.39041 0.0146768)
                            (-30.2612 5.5433 -0.487098 0.020417)
        );
    }
}
