tutorials/tutorials.DTLreactingFoam/counterFlowFlame2D/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
// this is setting for DTM 
usingDetailedTransportModel  true;  //newly added
usingCoTHERM                 true;  //newly added

majorSpeciesForCoTHERM (CH4 O2 CO2 H2O);  //newly added
epsilonT          0.2;   // [K], newly added
epsilonP          100;   // [Pa], newly added
epsilonS          0.001; // [-], in mass fraction, newly added

thermoType
{
    type            hePsiThermo;
    //mixture         multiComponentMixture;
    mixture         DTMMultiComponentMixture; //for DTM
    //transport       sutherland;
    transport       DTMTransport;  //for DTM
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;
//#include "thermo.compressibleGas"
#include "thermo.DTM" //for DTM
// end of setting for DTM
*/

/*
// this is setting for preprocessing FTM
usingDetailedTransportModel  true;   //newly added
usingCoTHERM                 false;  //newly added
usingPreProcessingFTM        true;   //must be true, default is false

majorSpeciesForCoTHERM (CH4 O2 CO2 H2O);  //newly added
epsilonT          0.2;   // [K], newly added
epsilonP          100;   // [Pa], newly added
epsilonS          0.001; // [-], in mass fraction, newly added

thermoType
{
    type            hePsiThermo;
    mixture         DTMMultiComponentMixture;   //for preprocessing FTM
    transport       preProcessingFTMTransport;  //for preprocessing FTM
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;
#include "thermo.DTM" //for DTM
// end of setting for preprocessing FTM
*/



// this is setting for FTM
usingDetailedTransportModel  true;  //newly added
usingCoTHERM                 true;  //newly added

majorSpeciesForCoTHERM (CH4 O2 CO2 H2O);  //newly added
epsilonT          0.2;   // [K], newly added
epsilonP          100;   // [Pa], newly added
epsilonS          0.001; // [-], in mass fraction, newly added

thermoType
{
    type            hePsiThermo;
    mixture         FTMMultiComponentMixture; //for FTM
    transport       FTMTransport;  //for FTM
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;
#include "thermo.FTM" //for FTM
// end of setting for FTM


// ************************************************************************* //
